src/borwall-ex1-densityBased/testCases/borwall-ex1/constant/numericalParameters
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.5                                   |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          numericalParameters;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

tol 1e-8;

 // initial step length
gamma 100.0;

 / steplength backtracking parameters
 c1 1e-4;
 c2 0.8;

// ************************************************************************* //